# Module 4 Project -Task 2

Author: [Hayley Massey](https://github.com/HMas522)
Repository: [datafun-04-notebooks](https://github.com/HMas522/datafun-04-notebooks)

# Task 2.1

In [1]:
#This cell is Python
import pandas as pd

In [2]:
#Create a dictionary
grades_dict ={'Wally': [87, 96, 70], 'Eva': [100, 87, 90], 'Sam' : [94, 77, 90], 'Katie' : [100, 81, 82], 'Bob' : [83, 65, 85]}

#Define Data frame
grades =pd.DataFrame(grades_dict)

#Produce dictionary
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

# Task 2.2

In [3]:
#Index the attribute ie. label the test number
grades.index = ['Test 1', 'Test 2', 'Test 3']

#Output the new index'd attribute
grades

        Wally  Eva  Sam  Katie  Bob
Test 1     87  100   94    100   83
Test 2     96   87   77     81   65
Test 3     70   90   90     82   85

In [4]:
#TODO Find Sam's grades
grades.Sam

Test 1    94
Test 2    77
Test 3    90
Name: Sam, dtype: int64

# Task 2.3 loc & iloc

In [5]:
#TODO use loc attribute - I prefer this method
grades.loc['Test 1']

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test 1, dtype: int64

In [8]:
#TODO use iloc attribute - Test 2
grades.iloc[1]

Wally    96
Eva      87
Sam      77
Katie    81
Bob      65
Name: Test 2, dtype: int64

In [12]:
#TODO display test 1 through 3 
grades.loc['Test 1': 'Test 3']

        Wally  Eva  Sam  Katie  Bob
Test 1     87  100   94    100   83
Test 2     96   87   77     81   65
Test 3     70   90   90     82   85

In [13]:
#TODO exclude test 3
grades.iloc[0:2]

        Wally  Eva  Sam  Katie  Bob
Test 1     87  100   94    100   83
Test 2     96   87   77     81   65

In [16]:
#Specify rows with loc
grades.loc[['Test 1', 'Test 3']]

        Wally  Eva  Sam  Katie  Bob
Test 1     87  100   94    100   83
Test 3     70   90   90     82   85

In [17]:
#Specify rows with iloc
grades.iloc[[0,2]]

        Wally  Eva  Sam  Katie  Bob
Test 1     87  100   94    100   83
Test 3     70   90   90     82   85